Revit 2027 API
ViewNode.GetCameraInfo Method
 Information about the observation point (the camera) of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CameraInfo GetCameraInfo()
Public Function GetCameraInfo As CameraInfo
public:
CameraInfo^ GetCameraInfo()
member GetCameraInfo : unit -> CameraInfo
Return Value
CameraInfo
 An instance of CameraInfo or null if there is no info associated with the view
See Also
Reference
ViewNode Class
Autodesk.Revit.DB Namespace